Even if I don't explicitly use the client_id variable (as shown here), I still receive a message indicating that the resource will be force-replaced. This seems to happen because the resource relies on some data to determine the principal_id.

```
module "aks_ods01" {
  source  = "Azure/aks/azurerm"
  version = "9.2.0"

  resource_group_name             = local.ods01_rg
  location                        = local.location
  kubernetes_version              = local.ods01_cluster_kubernetes_version
  cluster_name                    = data.azurecaf_name.aks_name.result
  prefix                          = data.azurecaf_name.aks_name.result
  log_analytics_workspace_enabled = false
  rbac_aad                        = false
  private_cluster_enabled         = local.ods01_private_cluster_enabled
  net_profile_pod_cidr            = local.ods01_net_profile_pod_cidr
  net_profile_service_cidr        = local.ods01_net_profile_service_cidr
  net_profile_dns_service_ip      = local.ods01_net_profile_dns_service_ip
  vnet_subnet_id                  = local.ods01_subnet_id
  identity_type                   = "UserAssigned"
  identity_ids                    = [azurerm_user_assigned_identity.main.id]
  os_disk_size_gb                 = 60
  agents_max_pods                 = 128
  sku_tier                        = local.ods01_cluster_sku_tier
  node_pools                      = local.ods01_nodes
  enable_auto_scaling             = local.ods01_default_nodepool_auto_scaling
  agents_availability_zones       = local.ods01_default_nodepool_zones
  agents_pool_name                = local.ods01_default_nodepool_name
  agents_count                    = local.ods01_default_nodepool_agents_count
  agents_min_count                = local.ods01_default_nodepool_min_count
  agents_max_count                = local.ods01_default_nodepool_max_count
  temporary_name_for_rotation     = local.ods01_default_nodepool_temporary_name_for_rotation
  network_plugin                  = local.ods01_network_plugin
  network_plugin_mode             = local.ods01_network_plugin_mode
  network_contributor_role_assigned_subnet_ids = {
    ods01_subnet_id = local.ods01_subnet_id
  }
  tags       = local.ods01_aks_tags
  depends_on = [azurerm_role_assignment.main]
}
```

As a result, every time I run terraform plan or terraform apply, it triggers a force-replace action.




```
  # module.aks_monitor.azurerm_role_assignment.network_contributor_on_subnet["monitor_subnet_id"] must be replaced
-/+ resource "azurerm_role_assignment" "network_contributor_on_subnet" {
      ~ id                                     = "/subscriptions/*********/resourceGroups/rg-nonprod-ods-qa-uks/providers/Microsoft.Network/virtualNetworks/vnet-nonprod-ods-qa-uks/subnets/snet-nonprod-ods-qa-uks-monitor/providers/Microsoft.Authorization/roleAssignments/******" -> (known after apply)
      ~ name                                   = "*******" -> (known after apply)
      ~ principal_id                           = "***********" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/500adf42-4c55-42be-96e1-76039abcdae0/providers/Microsoft.Authorization/roleDefinitions/*******" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }
```